posts/poems.2024-02-04.org
#+title: Rest
#+date: 2024-02-04

#+begin_verse
When I rest my troubles steep,
A breath of air, a wink of sleep.
A blip of fun, an interlude
Too much! My thoughts will catch me.

To recline / to end today,
reserves tomorrow; an arranged disgrace
I cannot bear that thoughtful sight - 
A scream: betrayal crying out my eyes

And so on I work through the night,
chills reek my body but not my mind
Too weak to find the help I need,
Too weak to let them catch me. 
#+end_verse







