poems.2024-02-04.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Rest</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tomaz GdA" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Rest</h1>
<p class="verse">
When I rest my troubles steep,<br />
A breath of air, a wink of sleep.<br />
A blip of fun, an interlude<br />
Too much! My thoughts will catch me.<br />
<br />
To recline / to end today,<br />
reserves tomorrow; an arranged disgrace<br />
I cannot bear that thoughtful sight -<br />
A scream: betrayal crying out my eyes<br />
<br />
And so on I work through the night,<br />
chills reek my body but not my mind<br />
Too weak to find the help I need,<br />
Too weak to let them catch me.<br />
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tomaz GdA</p>
</div>
</body>
</html>
